app/controllers/articles_controller.rb

SELECT "articles".* FROM "articles"
---
  def index
    debugger
    @articles = Article.all

SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT 1  [["id", "6"]]
---
  def show
    @article = Article.find params[:id]

INSERT INTO "articles" ("created_at", "text", "title", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Tue, 08 Mar 2016 10:14:59 UTC +00:00], ["text", "fgxcv"], ["title", "gefv"], ["updated_at", Tue, 08 Mar 2016 10:14:59 UTC +00:00]]
---
  def create
    debugger
    @article = Article.new article_params
    if @article.save